# 시카고 데이터 포털 데이터이해

이 노트북에서 과제를 완료하려면 시카고 데이터 포털에서 사용할 수있는 세 가지 데이터 세트를 사용하게됩니다.
1. <a href="https://data.cityofchicago.org/Health-Human-Services/Census-Data-Selected-socioeconomic-indicators-in-C/kn9c-c2s2"> 시카고의 사회 경제적 지표 </a>
1. <a href="https://data.cityofchicago.org/Education/Chicago-Public-Schools-Progress-Report-Cards-2011-/9xs2-f89t"> 시카고 공립학교 </a>
1. <a href="https://data.cityofchicago.org/Public-Safety/Crimes-2001-to-present/ijzp-q8t2"> 시카고 범죄 데이터 </a>

### 1. 시카고의 사회 경제적 지표
이 데이터 세트에는 2008 년에서 2012 년 사이에 시카고 커뮤니티 지역별로 공중 보건의 중요성에 대한 6 가지 사회 경제적 지표와 "어려움 지수"가 포함되어 있습니다.

다음에서 다운로드 할 수있는이 데이터 세트의 스냅 샷을 사용합니다.  
https://ibm.box.com/shared/static/05c3415cbfbtfnr2fx4atenb2sd361ze.csv

이 데이터 세트 및 원본 데이터 세트에 대한 자세한 설명은 시카고 데이터 포털에서 얻을 수 있습니다.  
https://data.cityofchicago.org/Health-Human-Services/Census-Data-Selected-socioeconomic-indicators-in-C/kn9c-c2s2



### 2. 시카고 공립학교

이 데이터 세트는 2011-2012 학년도 동안 CPS 학교 성적표를 작성하는 데 사용 된 모든 학교 수준의 성과 데이터를 보여줍니다. 이 데이터 세트는 시카고 데이터 포털시에서 제공합니다.

다음에서 다운로드 할 수있는이 데이터 세트의 스냅 샷을 사용합니다.  
https://ibm.box.com/shared/static/0g7kbanvn5l2gt2qu38ukooatnjqyuys.csv

이 데이터 세트 및 원본 데이터 세트에 대한 자세한 설명은 시카고 데이터 포털에서 얻을 수 있습니다.  
https://data.cityofchicago.org/Education/Chicago-Public-Schools-Progress-Report-Cards-2011-/9xs2-f89t




### 3. 시카고 범죄 데이터

이 데이터 세트는 2001 년부터 현재까지 시카고시에서 발생한 가장 최근의 7 일 동안 발생한 사건 (피해자마다 데이터가있는 살인 사건 제외)을 반영합니다.

이 데이터 세트는 크기가 매우 커서 크기가 1.5GB 이상이며 650 만 개가 넘습니다. 이 과제의 목적을 위해 다음에서 다운로드 할 수있는이 데이터 세트의 훨씬 작은 샘플을 사용할 것입니다.  
https://ibm.box.com/shared/static/svflyugsr9zbqy5bmowgswqemfpm1x7f.csv

이 데이터 세트 및 원본 데이터 세트에 대한 자세한 설명은 시카고 데이터 포털에서 얻을 수 있습니다.  
https://data.cityofchicago.org/Public-Safety/Crimes-2001-to-present/ijzp-q8t2

In [1]:
import pandas as pd

In [2]:
CENSUS_DATA = pd.read_csv("Chicago-Crime-Data/Chicago_sensus.csv")
CHICAGO_PUBLIC_SCHOOLS = pd.read_csv("Chicago-Crime-Data/Chicago_Public_Schools.csv")
CHICAGO_CRIME_DATA = pd.read_csv("Chicago-Crime-Data/Chicago_Crime_Data.csv")

In [3]:
CENSUS_DATA.head()

,COMMUNITY_AREA_NUMBER,COMMUNITY_AREA_NAME,PERCENT OF HOUSING CROWDED,PERCENT HOUSEHOLDS BELOW POVERTY,PERCENT AGED 16+ UNEMPLOYED,PERCENT AGED 25+ WITHOUT HIGH SCHOOL DIPLOMA,PERCENT AGED UNDER 18 OR OVER 64,PER_CAPITA_INCOME,HARDSHIP_INDEX
0,1.0,Rogers Park,7.7,23.6,8.7,18.2,27.5,23939,39.0
1,2.0,West Ridge,7.8,17.2,8.8,20.8,38.5,23040,46.0
2,3.0,Uptown,3.8,24.0,8.9,11.8,22.2,35787,20.0
3,4.0,Lincoln Square,3.4,10.9,8.2,13.4,25.5,37524,17.0
4,5.0,North Center,0.3,7.5,5.2,4.5,26.2,57123,6.0

In [4]:
CHICAGO_PUBLIC_SCHOOLS.head()

,School ID,NAME_OF_SCHOOL,"Elementary, Middle, or High School",Street Address,City,State,ZIP Code,Phone Number,Link,Network Manager,...,Freshman on Track Rate %,X_COORDINATE,Y_COORDINATE,Latitude,Longitude,COMMUNITY_AREA_NUMBER,COMMUNITY_AREA_NAME,Ward,Police District,Location
0,610038,Abraham Lincoln Elementary School,ES,615 W Kemper Pl,Chicago,IL,60614,(773) 534-5720,http://schoolreports.cps.edu/SchoolProgressRep...,Fullerton Elementary Network,...,NDA,1171699.458,1915829.428,41.924497,-87.644522,7,LINCOLN PARK,43,18,"(41.92449696, -87.64452163)"
1,610281,Adam Clayton Powell Paideia Community Academy ...,ES,7511 S South Shore Dr,Chicago,IL,60649,(773) 535-6650,http://schoolreports.cps.edu/SchoolProgressRep...,Skyway Elementary Network,...,NDA,1196129.985,1856209.466,41.760324,-87.556736,43,SOUTH SHORE,7,4,"(41.76032435, -87.55673627)"
2,610185,Adlai E Stevenson Elementary School,ES,8010 S Kostner Ave,Chicago,IL,60652,(773) 535-2280,http://schoolreports.cps.edu/SchoolProgressRep...,Midway Elementary Network,...,NDA,1148427.165,1851012.215,41.747111,-87.731702,70,ASHBURN,13,8,"(41.74711093, -87.73170248)"
3,609993,Agustin Lara Elementary Academy,ES,4619 S Wolcott Ave,Chicago,IL,60609,(773) 535-4389,http://schoolreports.cps.edu/SchoolProgressRep...,Pershing Elementary Network,...,NDA,1164504.290,1873959.199,41.809757,-87.672145,61,NEW CITY,20,9,"(41.8097569, -87.6721446)"
4,610513,Air Force Academy High School,HS,3630 S Wells St,Chicago,IL,60609,(773) 535-1590,http://schoolreports.cps.edu/SchoolProgressRep...,Southwest Side High School Network,...,91.8,1175177.622,1880745.126,41.828146,-87.632794,34,ARMOUR SQUARE,11,9,"(41.82814609, -87.63279369)"

In [5]:
CHICAGO_CRIME_DATA.head()

,ID,CASE_NUMBER,DATE,BLOCK,IUCR,PRIMARY_TYPE,DESCRIPTION,LOCATION_DESCRIPTION,ARREST,DOMESTIC,...,WARD,COMMUNITY_AREA_NUMBER,FBICODE,X_COORDINATE,Y_COORDINATE,YEAR,UPDATEDON,LATITUDE,LONGITUDE,LOCATION
0,3512276,HK587712,08/28/2004 05:50:56 PM,047XX S KEDZIE AVE,890,THEFT,FROM BUILDING,SMALL RETAIL STORE,False,False,...,14.0,58.0,6,1155838.0,1873050.0,2004,02/10/2018 03:50:01 PM,41.807440,-87.703956,"(41.8074405, -87.703955849)"
1,3406613,HK456306,06/26/2004 12:40:00 PM,009XX N CENTRAL PARK AVE,820,THEFT,$500 AND UNDER,OTHER,False,False,...,27.0,23.0,6,1152206.0,1906127.0,2004,02/28/2018 03:56:25 PM,41.898280,-87.716406,"(41.898279962, -87.716405505)"
2,8002131,HT233595,04/04/2011 05:45:00 AM,043XX S WABASH AVE,820,THEFT,$500 AND UNDER,NURSING HOME/RETIREMENT HOME,False,False,...,3.0,38.0,6,1177436.0,1876313.0,2011,02/10/2018 03:50:01 PM,41.815933,-87.624642,"(41.815933131, -87.624642127)"
3,7903289,HT133522,12/30/2010 04:30:00 PM,083XX S KINGSTON AVE,840,THEFT,FINANCIAL ID THEFT: OVER $300,RESIDENCE,False,False,...,7.0,46.0,6,1194622.0,1850125.0,2010,02/10/2018 03:50:01 PM,41.743665,-87.562463,"(41.743665322, -87.562462756)"
4,10402076,HZ138551,02/02/2016 07:30:00 PM,033XX W 66TH ST,820,THEFT,$500 AND UNDER,ALLEY,False,False,...,15.0,66.0,6,1155240.0,1860661.0,2016,02/10/2018 03:50:01 PM,41.773455,-87.706480,"(41.773455295, -87.706480471)"

column 의 이름이 MySQL column name rule 에 맞도록 수정.

In [6]:
CENSUS_DATA.columns

Index(['COMMUNITY_AREA_NUMBER', 'COMMUNITY_AREA_NAME',
       'PERCENT OF HOUSING CROWDED', 'PERCENT HOUSEHOLDS BELOW POVERTY',
       'PERCENT AGED 16+ UNEMPLOYED',
       'PERCENT AGED 25+ WITHOUT HIGH SCHOOL DIPLOMA',
       'PERCENT AGED UNDER 18 OR OVER 64', 'PER_CAPITA_INCOME ',
       'HARDSHIP_INDEX'],
      dtype='object')

In [7]:
def replace(columns):
    new_columns = []
    for column in columns:
        column = column.replace("+", "")
        column = column.replace(",", "")
        column = column.replace("-", "_")
        column = column.replace(" ", "_")
        column = column.replace("_%", "")
        new_columns.append(column)
    return new_columns

new_columns = replace(CENSUS_DATA.columns.values)
CENSUS_DATA.columns = new_columns

new_columns = replace(CHICAGO_PUBLIC_SCHOOLS .columns.values)
CHICAGO_PUBLIC_SCHOOLS.columns = new_columns

new_columns = replace(CHICAGO_CRIME_DATA  .columns.values)
CHICAGO_CRIME_DATA.columns = new_columns

In [8]:
CHICAGO_PUBLIC_SCHOOLS.columns

Index(['School_ID', 'NAME_OF_SCHOOL', 'Elementary_Middle_or_High_School',
       'Street_Address', 'City', 'State', 'ZIP_Code', 'Phone_Number', 'Link_',
       'Network_Manager', 'Collaborative_Name',
       'Adequate_Yearly_Progress_Made?_', 'Track_Schedule',
       'CPS_Performance_Policy_Status', 'CPS_Performance_Policy_Level',
       'HEALTHY_SCHOOL_CERTIFIED', 'Safety_Icon_', 'Safety_Score',
       'Family_Involvement_Icon', 'Family_Involvement_Score',
       'Environment_Icon_', 'Environment_Score', 'Instruction_Icon_',
       'Instruction_Score', 'Leaders_Icon_', 'Leaders_Score_',
       'Teachers_Icon_', 'Teachers_Score', 'Parent_Engagement_Icon_',
       'Parent_Engagement_Score', 'Parent_Environment_Icon',
       'Parent_Environment_Score', 'AVERAGE_STUDENT_ATTENDANCE',
       'Rate_of_Misconducts_(per_100_students)_', 'Average_Teacher_Attendance',
       'Individualized_Education_Program_Compliance_Rate_', 'Pk_2_Literacy',
       'Pk_2_Math', 'Gr3_5_Grade_Level_Math', 'Gr3_5_Grade_Level_Read_',
       'Gr3_5_Keep_Pace_Read', 'Gr3_5_Keep_Pace_Math',
       'Gr6_8_Grade_Level_Math', 'Gr6_8_Grade_Level_Read',
       'Gr6_8_Keep_Pace_Math%', 'Gr6_8_Keep_Pace_Read', 'Gr_8_Explore_Math',
       'Gr_8_Explore_Read', 'ISAT_Exceeding_Math', 'ISAT_Exceeding_Reading_',
       'ISAT_Value_Add_Math', 'ISAT_Value_Add_Read',
       'ISAT_Value_Add_Color_Math', 'ISAT_Value_Add_Color_Read',
       'Students_Taking__Algebra', 'Students_Passing__Algebra',
       '9th_Grade_EXPLORE_(2009)_', '9th_Grade_EXPLORE_(2010)_',
       '10th_Grade_PLAN_(2009)_', '10th_Grade_PLAN_(2010)_',
       'Net_Change_EXPLORE_and_PLAN', '11th_Grade_Average_ACT_(2011)_',
       'Net_Change_PLAN_and_ACT', 'College_Eligibility', 'Graduation_Rate',
       'College_Enrollment_Rate', 'COLLEGE_ENROLLMENT',
       'General_Services_Route_', 'Freshman_on_Track_Rate', 'X_COORDINATE',
       'Y_COORDINATE', 'Latitude', 'Longitude', 'COMMUNITY_AREA_NUMBER',
       'COMMUNITY_AREA_NAME', 'Ward', 'Police_District', 'Location'],
      dtype='object')

In [9]:
CENSUS_DATA.columns

Index(['COMMUNITY_AREA_NUMBER', 'COMMUNITY_AREA_NAME',
       'PERCENT_OF_HOUSING_CROWDED', 'PERCENT_HOUSEHOLDS_BELOW_POVERTY',
       'PERCENT_AGED_16_UNEMPLOYED',
       'PERCENT_AGED_25_WITHOUT_HIGH_SCHOOL_DIPLOMA',
       'PERCENT_AGED_UNDER_18_OR_OVER_64', 'PER_CAPITA_INCOME_',
       'HARDSHIP_INDEX'],
      dtype='object')

### 데이터베이스 테이블에 데이터 집합 저장
SQL을 사용하여 데이터를 분석하려면 먼저 데이터베이스에 저장해야합니다.

새 테이블의 이름을 다음과 같이 지정하십시오.
1. CENSUS_DATA
1. CHICAGO_PUBLIC_SCHOOLS
1. CHICAGO_CRIME_DATA

In [10]:
import pymysql.cursors

con = pymysql.connect(host='localhost',
        user='root',
        password='dreamer01',
        charset='utf8mb4')

cur = con.cursor()

### Database 생성

In [11]:
try:
    cur.execute('DROP DATABASE IF EXISTS datascience')
    cur.execute('CREATE DATABASE datascience')
    print('Database datascience 생성 완료')
    con.commit()
except Exception as e:
    print ('error in operation, ', e)
    con.rollback()
finally:
    con.close()

Database datascience 생성 완료

In [12]:
con = pymysql.connect(host='localhost',
        user='root',
        password='dreamer01',
        db='datascience',
        charset='utf8mb4')

sql1 = "DROP TABLE censusdata;"
sql2 = "DROP TABLE chicagoschools;"
sql3 = "DROP TABLE chicagocrime;"
try:
    with con.cursor() as cursor:
        cursor.execute(sql1)
        cursor.execute(sql2)
        cursor.execute(sql3)
    con.commit()
    print("Table dropped : ", sql1)
    print("Table dropped : ", sql2)
    print("Table dropped : ", sql3)
except:
    print("No table to drop")
finally:
    con.close()

No table to drop

In [13]:
import sqlalchemy
from sqlalchemy import create_engine
engine = create_engine("mysql+pymysql://root:dreamer01@localhost/datascience?charset=utf8")
conn = engine.connect()
transaction = conn.begin()

### insert pandas DataFrame to table

In [14]:
CENSUS_DATA.to_sql('censusdata', conn, if_exists='replace', index=False)
CHICAGO_PUBLIC_SCHOOLS.to_sql('chicagoschools', conn, if_exists='replace', index=False)
CHICAGO_CRIME_DATA.to_sql('chicagocrime', conn, if_exists='replace', index=False)

533

In [15]:
transaction.commit()
conn.close()

## 문제
다음의 query를 작성하세요.

### dataset의 row 갯수는 ?

In [16]:
CHICAGO_PUBLIC_SCHOOLS.shape

(566, 78)

In [17]:
CENSUS_DATA.shape

(78, 9)

In [18]:
census_cnt = pd.read_sql("SELECT count(*) from censusdata", con=engine)
census_cnt

   count(*)
0        78

In [19]:
census_cnt.values[0].item()

78

In [20]:
census_cnt = pd.read_sql("SELECT count(*) from censusdata", con=engine).values[0].item()
school_cnt = pd.read_sql("SELECT count(*) from chicagoschools", con=engine).values[0].item()
crime_cnt =  pd.read_sql("SELECT count(*) from chicagocrime", con=engine).values[0].item()
print(census_cnt)
print(school_cnt)
print(crime_cnt)

78
566
533

### chicagoschools table의 community area 별 대학 등록 학생 수

COLLEGE_ENROLLMENT : 대학에 등록한 학생 수  
COMMUNITY_AREA_NUMBER : 커뮤니티 지역 코드

In [22]:
sql = """
SELECT COMMUNITY_AREA_NUMBER , SUM(COLLEGE_ENROLLMENT) from chicagoschools
group by COMMUNITY_AREA_NUMBER ORDER BY COMMUNITY_AREA_NUMBER
"""
pd.read_sql(sql, con=engine)

    COMMUNITY_AREA_NUMBER  SUM(COLLEGE_ENROLLMENT)
0                       1                   4068.0
1                       2                   8197.0
2                       3                   4388.0
3                       4                   4132.0
4                       5                   7541.0
..                    ...                      ...
72                     73                   4006.0
73                     74                   2091.0
74                     75                   3271.0
75                     76                    786.0
76                     77                   4600.0

[77 rows x 2 columns]

In [24]:
CHICAGO_PUBLIC_SCHOOLS["COLLEGE_ENROLLMENT"] \
            .groupby(CHICAGO_PUBLIC_SCHOOLS["COMMUNITY_AREA_NUMBER"]).sum()

COMMUNITY_AREA_NUMBER
1     4068
2     8197
3     4388
4     4132
5     7541
      ...
73    4006
74    2091
75    3271
76     786
77    4600
Name: COLLEGE_ENROLLMENT, Length: 77, dtype: int64

### HEALTHY_SCHOOL_CERTIFIE 인증을 받은 학교의 수
- 'HEALTHY_SCHOOL_CERTIFIED' = 'Yes'

In [29]:
sql = """
SELECT COUNT(*) from chicagoschools
WHERE HEALTHY_SCHOOL_CERTIFIED = "Yes"
"""
pd.read_sql(sql, con=engine)

   COUNT(*)
0        16

In [30]:
CHICAGO_PUBLIC_SCHOOLS[CHICAGO_PUBLIC_SCHOOLS['HEALTHY_SCHOOL_CERTIFIED'] == 'Yes'].shape

(16, 78)

### chicagocrime table의 GAS STATION의 위치 설명 값이 있는 관측치 수
- 'LOCATION_DESCRIPTION' = 'GAS STATION'

In [36]:
sql = """
SELECT COUNT(*) from chicagocrime
WHERE LOCATION_DESCRIPTION = 'GAS STATION'
"""
pd.read_sql(sql, con=engine)

   COUNT(*)
0         6

In [37]:
CHICAGO_CRIME_DATA[CHICAGO_CRIME_DATA['LOCATION_DESCRIPTION'] == 'GAS STATION'].shape

(6, 22)

### 대부분의 학교가 포함되어 있고 내림차순으로 정렬된 상위 10개 커뮤니티 영역 목록을 검색합니다.

In [46]:
sql = """
SELECT COMMUNITY_AREA_NUMBER, count(School_ID) count  from chicagoschools 
GROUP BY COMMUNITY_AREA_NUMBER 
ORDER BY count DESC limit 10
"""
pd.read_sql(sql, con=engine)

   COMMUNITY_AREA_NUMBER  count
0                     25     23
1                     30     22
2                     24     20
3                     68     17
4                     29     16
5                     28     16
6                     61     13
7                     27     13
8                     49     13
9                     23     13

In [43]:
CHICAGO_PUBLIC_SCHOOLS["School_ID"] \
            .groupby(CHICAGO_PUBLIC_SCHOOLS["COMMUNITY_AREA_NUMBER"]).count().sort_values(ascending=False).head(10)

COMMUNITY_AREA_NUMBER
25    23
30    22
24    20
68    17
28    16
29    16
61    13
67    13
49    13
27    13
Name: School_ID, dtype: int64

### Primary Type 변수값이 "MOTOR VEHICLE THEFT" 인 row의 갯수(이는 자동차와 관련된 범죄의 수)

In [47]:
sql = """
SELECT COUNT(*) from chicagocrime
WHERE PRIMARY_TYPE = 'MOTOR VEHICLE THEFT'
"""
pd.read_sql(sql, con=engine)

   COUNT(*)
0        24

In [48]:
CHICAGO_CRIME_DATA[CHICAGO_CRIME_DATA['PRIMARY_TYPE'] == 'MOTOR VEHICLE THEFT'].shape

(24, 22)

#### CHICAGO_PUBLIC_SCHOOLS 과 CENSUS_DATA table을 지역 코드(COMMUNITY_AREA_NUMBER) 로 inner join 하여 CENSUS_DATA 의 HARDSHIP_INDEX 가 96 인 지역의 가장 낮은 학생평균출석율 (AVERAGE_STUDENT_ATTENDANCE) 을 구하라.

In [55]:
sql = """
SELECT S.AVERAGE_STUDENT_ATTENDANCE, C.HARDSHIP_INDEX from chicagoschools S INNER JOIN censusdata C 
ON S.COMMUNITY_AREA_NUMBER = C.COMMUNITY_AREA_NUMBER 
WHERE C.HARDSHIP_INDEX = 96 
ORDER BY S.AVERAGE_STUDENT_ATTENDANCE LIMIT 1
"""
pd.read_sql(sql, con=engine)

  AVERAGE_STUDENT_ATTENDANCE  HARDSHIP_INDEX
0                     86.10%            96.0

In [56]:
CHICAGO_PUBLIC_SCHOOLS[["COMMUNITY_AREA_NUMBER", "AVERAGE_STUDENT_ATTENDANCE"]] \
            .merge(CENSUS_DATA[CENSUS_DATA['HARDSHIP_INDEX'] == 96], 
                             left_on="COMMUNITY_AREA_NUMBER", right_on='COMMUNITY_AREA_NUMBER')\
                                ["AVERAGE_STUDENT_ATTENDANCE"].min()

'86.10%'